etc/OpenFOAM_Sample_Files/2_building_test/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

//find help here http://cfd.direct/openfoam/user-guide/blockmesh/

vertices
(
    (0 0 0) //0
    (10 0 0) //1
    (10 10 0) //2
    (0 10 0) //3

    (0 0 10) //4
    (10 0 10) //5
    (10 10 10) //6
    (0 10 10) //7
);

blocks
(
    hex /*list of points in block*/(0 1 2 3 4 5 6 7) /*number of mesh divisions to create in each direction*/(10 10 10) /*cell expansion ratio in each direction*/simpleGrading (1 1 1) //bottom block
);

edges
(
);

boundary
(
    mesh_min_max
    {
        type wall;
        faces
        (
            //list of points on the boundary, normal of these should point outward (if you're standing inside the block, these should be clockwise)
            (0 3 2 1)


            (4 5 6 7)


            (0 1 5 4)

            (7 6 2 3)

            (6 5 1 2)

            (4 7 3 0)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
